[
  {
    "createdAt": 1684320435,
    "fixes": [
      "This release consists primarily of internal fixes and improvements and does not introduce any changes that directly affect our users."
    ],
    "features": [
      "You can add timed metadata to your video stream using [Dyte's interactive recording](/guides/recording/interactive-recording). Timed metadata is metadata with timestamps. It refers to digital markers added to a video file to provide additional context and information at specific points in the content range. These data points can be inserted into a stream programmatically, using the interactive_config in the [Start recording a meeting API](/api/#/operations/start_recording)."
    ]
  },
  {
    "createdAt": 1677473766,
    "fixes": [
      "The response of v2 [create](/api#/operations/create_meeting) and [update](/api#/operations/update_meeting) meeting API has been updated to include `live_stream_on_start` parameter.",
      "The allowed `preferred_regions` in v2 meetings has been expanded to include `eu-central-1`.",
      "Recording storage body validation has been updated to allow empty strings."
    ],
    "features": [
      "You can add an image as a [watermark](/guides/recording/add-watermark) in your recording. See [Start recording a meeting API](/api#/operations/start_recording).",
      "Support for recording a video in portrait mode is added. You can specify the width and height of the recording in the `video_config` in [Start recording a meeting API](/api#/operations/start_recording).",
      "Maximum height of the recorder has been increased to 1920px.",
      "[Create a preset API](/api#/operations/post-presets) has been updated to include a new permission, `can_livestream`.",
      "[Update a meeting API](/api#/operations/update_meeting) has been updated to include status in the request body.",
      "The webhook event validations have been updated for the `chat_sync` event.",
      "Schema validation has been added for v2 preset UI."
    ]
  }
]
